package com.example.imt

class TextFile {
    val textTypeLow = "У Вас дефицит веса"
    val textTypeNorm = "Ваше телосложение нормальное"
    val textTypeHigh = "У вас излишний вес"
    val textTypeVHigh = "У Вас чрезмерное ожирение"
    val textLow = "Набор веса может быть сложной задачей для тех, кто борется с недостаточным весом или стремится увеличить мышечную массу. Но важно помнить, что набор веса должен происходить здоровым и безопасным способом. Вот более подробное руководство по этому процессу.\n" +
            "1. Увеличьте калорийность питания\n" +
            "Набор веса в основном сводится к увеличению количества потребляемых калорий. Однако это не означает, что вам нужно есть только фаст-фуд и сладости. Вместо этого выбирайте питательные продукты, богатые калориями, такие как:\n" +
            "Орехи и семена: Они содержат много здоровых жиров и белка. Орехи также являются отличным источником витаминов и минералов.\n" +
            "Авокадо: Этот плод богат здоровыми жирами и содержит важные витамины и минералы.\n" +
            "Молочные продукты: Молоко, сыр и йогурт содержат много белка и кальция.\n" +
            "Мясо и рыба: Они являются отличными источниками белка и содержат много витаминов группы B.\n" +
            "Зерновые: Овсянка, киноа, коричневый рис и другие зерновые богаты витаминами, минералами и волокнами.\n" +
            "2. Белки - ваш лучший друг\n" +
            "Белки играют важную роль в построении мышц. Увеличение потребления белка поможет вам набрать вес и увеличить мышечную массу. Стремитесь к тому, чтобы каждый ваш прием пищи содержал хороший источник белка.\n" +
            "3. Упражнения\n" +
            "Силовые тренировки могут помочь вам увеличить мышечную массу и набрать вес. Важно делать это под руководством профессионала, чтобы избежать травм. Также важно включать в программу упражнения на все основные группы мышц\n" +
            "4. Вода\n" +
            "Вода не содержит калорий, но она важна для общего здоровья и может помочь вам усвоить больше пищи. Однако старайтесь не пить сразу перед едой, так как это может уменьшить ваш аппетит.\n" +
            "5. Не пренебрегайте здоровым сном\n" +
            "Качественный сон играет важную роль в процессе восстановления и роста мышц. Старайтесь спать не менее 7-8 часов каждую ночь. Помните, что во время сна происходят ключевые процессы восстановления и роста мышц. Недостаток сна может снизить ваш аппетит и замедлить процесс набора веса.\n" +
            "6. Консультация с врачом\n" +
            "Прежде чем начать любую программу по набору веса, обязательно проконсультируйтесь с врачом-диетологом. Он может помочь вам разработать план, который будет безопасным и эффективным для, учитывая ваши индивидуальные потребности и общее состояние здоровья.\n" +
            "7. Постепенность и терпение\n" +
            "Набор веса — это процесс, который требует времени. Не ожидайте быстрых результатов, и не увлекайтесь слишком высококалорийной пищей или чрезмерными тренировками. Вместо этого постепенно увеличивайте калорийность своего рациона и интенсивность тренировок.\n" +
            "8. Отслеживайте свой прогресс\n" +
            "Регулярно контролируйте свой вес и объемы тела, чтобы убедиться, что вы двигаетесь в правильном направлении. Это также поможет вам внести коррективы в свой план, если результаты не соответствуют ожиданиям.\n" +
            "Набор веса — это процесс, который требует времени, терпения, и прежде всего здорового подхода. Следуя этим рекомендациям, вы сможете набрать вес здоровым и безопасным способом, улучшив свое общее самочувствие и качество жизни."
    val textNorm = "Продолжайте в том же духе!"
    val textHigh = "Питание должно быть регулярным, дробным. Наличие 3-х основных приемов пищи и 2-х промежуточных является важной составляющей программы по снижению массы тела. Калорийность в течение суток должна распределяться таким образом: на завтрак - 25%, 2-й завтрак - 10%, обед - 35%, полдник - 10%, ужин - 20%.\n" +
            "Основой питания являются трудно усваиваемые углеводы. На их долю должно приходиться 55-60% суточной калорийности. Рекомендуется включать в рацион овощи 3-4 раза в день в сыром или приготовленном виде, фрукты не менее 2-3 раз в день.\n" +
            "Суточная потребность в белках составляет в среднем 1,5 г. на килограмм массы тела. При сбалансированном питании за счет белков пищи должно обеспечиваться 15% энергетических потребностей организма.\n" +
            "Ограничивается употребление жиров и легко усваиваемых углеводов. Доля жиров в рационе должна составлять не более 25-30%. Уменьшается также потребление насыщенных жиров до 8-10% от общего количества жира.\n" +
            "Здоровое питание предусматривает:\n" +
            "ограничение потребления высококалорийных продуктов, алкогольных напитков;\n" +
            "уменьшение наполовину от привычного потребление продуктов средней калорийности (продукты и блюда богатые крахмалом и клетчаткой, белками);\n" +
            "увеличение потребления низкокалорийных продуктов (все виды зелени и овощи (кроме картофеля и бобовых), фрукты (кроме винограда и бананов) и ягоды).\n" +
            "Эти принципы отражены в «пищевой пирамиде»:\n" +
            "в основании указанной «пищевой пирамиды» лежит употребление до 6 раз в сутки продуктов, содержащих медленные углеводы (крахмалы);\n" +
            "на втором уровне - употребление овощей и фруктов. Овощи употребляются до 3-5 раз в день;\n" +
            "третий уровень «пищевой пирамиды» включает, в основном, продукты животного происхождения (мясо, молоко, рыба), которые рекомендовано употреблять 2-3 раза в день;\n" +
            "вершина «пищевой пирамиды» - это высококалорийные продукты   (жиры и легкоусвояемые углеводы). Их употребление допускается только в исключительных случаях.\n" +
            "Физическая активность:\n" +
            "облегчает снижение веса у лиц с избыточной массой тела и ожирением;\n" +
            "способствует уменьшению абдоминально-висцерального жира;\n" +
            "улучшает состояние сердечно-сосудистой и дыхательной систем и переносимость физической нагрузки;\n" +
            "помогает длительно поддерживать достигнутый результат.\n" +
            "Важной составляющей программы по снижению и поддержанию массы тела является постепенное повышение физической нагрузки.\n" +
            "Физическая нагрузка состоит из 3-х этапов:\n" +
            "1-й этап: дозированная лечебная ходьба. Количество шагов – от 500 до 6000, время лечебной ходьбы на начальных этапах не ограничивают. Ходить необходимо после еды и контролировать: длину шага (70-80 см) скорость (4 км/ч.); дыхание должно быть равномерное, нефорсированное.\n" +
            "Интенсивность нагрузки:\n" +
            "начальная – 60-70 шагов в минуту;\n" +
            "для привыкания к нагрузке – 80-90 шагов в минуту;\n" +
            "для снижения веса – 100-110 шагов в минуту;\n" +
            "для устойчивого снижения веса – 120 шагов в минуту.\n" +
            "2-й этап: расширение физических нагрузок – плавание. Нагрузка увеличивается за счет сопротивления воды. Время плавания необходимо увеличивать постепенно и осторожно. Плавать необходимо до еды. Нельзя допускать переохлаждения и переутомления.\n" +
            "3-й этап: увеличение физической нагрузки - гимнастические упражнения. Вводится дополнительно, после выполнения программ нагрузок лечебной ходьбы и плавания. Гимнастические упражнения направлены на улучшения мышечного тонуса, восстановления гибкости позвоночника и растяжения связок.\n" +
            "При любой степени ожирения гимнастические упражнения необходимо выполнять:\n" +
            "из положения лежа – 2 месяца;\n" +
            "из положения сидя – 2 месяца;\n" +
            "из положения стоя – 2 месяца.\n" +
            "Исключить: наклоны, глубокие приседания, прыжки, ускорения, поднятие тяжестей, очень интенсивные упражнения.\n" +
            "Включить: гимнастические упражнения на растяжку, для поясничного отдела позвоночника и брюшного пресса. Минимальное количество повторов – 10 раз.\n" +
            "Если произошел перерыв в физических занятиях, необходимо снова начать выполнение уровня физической нагрузки, начиная с нагрузки первой недели.\n" +
            "Перед выполнением вышеуказанной программы рекомендуется выполнить ЭКГ и повторять ее ежемесячно.\n" +
            "Рекомендуемая система физической активности:\n" +
            "лечебная ходьба – 3 раза в неделю;\n" +
            "плавание – 2 раза в неделю;\n" +
            "физические упражнения в сочетании с лечебной ходьбой или плаванием – 5 раз в неделю;\n" +
            "отдых – один день в неделю.\n" +
            "Pекомендуемая физическая нагрузка для пациентов с ИМТ от 25 до 29,9.\n" +
            "Первая неделя - 2000 шагов в день. Каждую неделю увеличивать количество шагов на 500, к восьмой неделе должно быть до 6000 шагов в день (четыре километра). Дистанцию в четыре километра необходимо проходить ежедневно в течение двух или трех месяцев до тех пор, пока не получится ее легко преодолевать за 60 минут. Затем снижать время прохождения 4-х километров на 5 минут. Достигнув хорошей переносимости этой нагрузки необходимо проходить четыре километра за 45 минут три раза в день или 8-12 километров один раз в день.\n" +
            "При хорошем самочувствии необходимо начать посещение бассейна. Первое занятие должно длиться 10 минут, второе – 15 минут, третье – 20 минут, далее прибавлять по 5 минут на каждое занятие. Максимальная длительность плавания не должна превышать 45 минут на занятие.\n" +
            "Плавание и ходьбу необходимо чередовать через день. При этом, можно делать один или два дня отдыха в неделю.\n" +
            "Через 6 месяцев занятий лечебной ходьбой и плаванием необходимо расширить активность, добавив комплекс гимнастических упражнений под контролем врача лечебной физкультуры.\n" +
            "Рекомендуемая физическая нагрузка для пациентов с ИМТ от 30 до 34,9 (что соответствует I степени ожирения).\n" +
            "Первый уровень физической нагрузки - лечебная ходьба от 1000 шагов в день, постепенно увеличивая количество шагов до 6000 (четыре километра) к 10-ой неделе.\n" +
            "Далее ежемесячно необходимо повышать интенсивность физической нагрузки: проходить четыре километра за 60 минут в первый месяц и за 45 минут к четвертому месяцу.\n" +
            "Второй уровень физической нагрузки – плавание. Первое занятие - 5 минут, затем увеличивать время каждого занятия на 3-5 минут до 30 минут к восьмому занятию.\n" +
            "После шести месяцев занятий ходьбой и плаванием можно переходить к третьему уровню– гимнастическим упражнениям.\n" +
            "Рекомендуемая физическая нагрузка для пациентов с ИМТ от 35 до 39,9 (что соответствует II степени ожирения).\n" +
            "Лечебную ходьбу начинать с 300 шагов в день, постепенно увеличивая до 6000 (четыре километра) шагов к 15 неделе. Четыре километра необходимо ходить в течение 6 месяцев, постепенно повышая интенсивность (4 километра за 60 минут, 4 километра за 55 минут, 4 километра за 50 минут). Четыре километра за 50 минут необходимо ходить не менее 12 месяцев.\n" +
            "Второй уровень физических занятий – плавание. Первое занятие - 5 минут, постепенно увеличивая время до 20 минут к десятому занятию\n" +
            "Плавание и ходьбу необходимо чередовать через день. При этом можно делать один или два дня отдыха в неделю. После шести месяцев занятий ходьбой и плаванием можно переходить к третьему уровню – физическим упражнениям.\n" +
            "Рекомендуемая физическая нагрузка для пациентов с ИМТ более 40 (что соответствует морбидному ожирению).\n" +
            "Занятия начинаются с лечебной ходьбы. Первая неделя 100 шагов в минуту 3 раза в день после еды, к шестой неделе постепенно увеличивать количество шагов до 500 за пять минут 3 раза в день. С седьмой неделе – 600 шагов в день без учета времени и далее постепенно увеличивать количество шагов примерно по 100 каждый день до 6000 шагов к девятому месяцу (36 недель). Постепенно снижать время прохождения 4-х километров с 60 минут до 55 минут.\n" +
            "После выполнения предложенного уровня ходьбы, можно добавить плавание. Первое занятие - 5 минут. Каждое занятие увеличивать продолжительность на 1 минуту. К 14 занятию – время плавания 20 минут. Плавать 20 минут за одно занятие в течение 6 месяцев.\n" +
            "После одного года занятий ходьбой и плаванием можно переходить к третьему уровню – гимнастическим упражнениям.\n" +
            "Регулярную физическую активность можно также представить в виде пирамиды:\n" +
            "основание пирамиды - ежедневные пешие прогулки;\n" +
            "следующий уровень - занятия, которые помогают улучшить физическую тренированность (3-5 раз в неделю рекомендуется один из видов аэробных упражнений);\n" +
            "вершина пирамиды - неактивный отдых (рекомендуется проводить за просмотром телепередач не более 30 минут в день).\n" +
            "Преодоления стрессовых ситуаций: ежедневно рекомендуется здоровое питание, физическая активность, достаточный сон, наличие работы или хобби, отдых с семьей, позитивное общение с другими, смех, участие в социальной жизни."
    val textVHigh = "Питание должно быть регулярным, дробным. Наличие 3-х основных приемов пищи и 2-х промежуточных является важной составляющей программы по снижению массы тела. Калорийность в течение суток должна распределяться таким образом: на завтрак - 25%, 2-й завтрак - 10%, обед - 35%, полдник - 10%, ужин - 20%.\n" +
            "Основой питания являются трудно усваиваемые углеводы. На их долю должно приходиться 55-60% суточной калорийности. Рекомендуется включать в рацион овощи 3-4 раза в день в сыром или приготовленном виде, фрукты не менее 2-3 раз в день.\n" +
            "Суточная потребность в белках составляет в среднем 1,5 г. на килограмм массы тела. При сбалансированном питании за счет белков пищи должно обеспечиваться 15% энергетических потребностей организма.\n" +
            "Ограничивается употребление жиров и легко усваиваемых углеводов. Доля жиров в рационе должна составлять не более 25-30%. Уменьшается также потребление насыщенных жиров до 8-10% от общего количества жира.\n" +
            "Здоровое питание предусматривает:\n" +
            "ограничение потребления высококалорийных продуктов, алкогольных напитков;\n" +
            "уменьшение наполовину от привычного потребление продуктов средней калорийности (продукты и блюда богатые крахмалом и клетчаткой, белками);\n" +
            "увеличение потребления низкокалорийных продуктов (все виды зелени и овощи (кроме картофеля и бобовых), фрукты (кроме винограда и бананов) и ягоды).\n" +
            "Эти принципы отражены в «пищевой пирамиде»:\n" +
            "в основании указанной «пищевой пирамиды» лежит употребление до 6 раз в сутки продуктов, содержащих медленные углеводы (крахмалы);\n" +
            "на втором уровне - употребление овощей и фруктов. Овощи употребляются до 3-5 раз в день;\n" +
            "третий уровень «пищевой пирамиды» включает, в основном, продукты животного происхождения (мясо, молоко, рыба), которые рекомендовано употреблять 2-3 раза в день;\n" +
            "вершина «пищевой пирамиды» - это высококалорийные продукты   (жиры и легкоусвояемые углеводы). Их употребление допускается только в исключительных случаях.\n" +
            "Физическая активность:\n" +
            "облегчает снижение веса у лиц с избыточной массой тела и ожирением;\n" +
            "способствует уменьшению абдоминально-висцерального жира;\n" +
            "улучшает состояние сердечно-сосудистой и дыхательной систем и переносимость физической нагрузки;\n" +
            "помогает длительно поддерживать достигнутый результат.\n" +
            "Важной составляющей программы по снижению и поддержанию массы тела является постепенное повышение физической нагрузки.\n" +
            "Физическая нагрузка состоит из 3-х этапов:\n" +
            "1-й этап: дозированная лечебная ходьба. Количество шагов – от 500 до 6000, время лечебной ходьбы на начальных этапах не ограничивают. Ходить необходимо после еды и контролировать: длину шага (70-80 см) скорость (4 км/ч.); дыхание должно быть равномерное, нефорсированное.\n" +
            "Интенсивность нагрузки:\n" +
            "начальная – 60-70 шагов в минуту;\n" +
            "для привыкания к нагрузке – 80-90 шагов в минуту;\n" +
            "для снижения веса – 100-110 шагов в минуту;\n" +
            "для устойчивого снижения веса – 120 шагов в минуту.\n" +
            "2-й этап: расширение физических нагрузок – плавание. Нагрузка увеличивается за счет сопротивления воды. Время плавания необходимо увеличивать постепенно и осторожно. Плавать необходимо до еды. Нельзя допускать переохлаждения и переутомления.\n" +
            "3-й этап: увеличение физической нагрузки - гимнастические упражнения. Вводится дополнительно, после выполнения программ нагрузок лечебной ходьбы и плавания. Гимнастические упражнения направлены на улучшения мышечного тонуса, восстановления гибкости позвоночника и растяжения связок.\n" +
            "При любой степени ожирения гимнастические упражнения необходимо выполнять:\n" +
            "из положения лежа – 2 месяца;\n" +
            "из положения сидя – 2 месяца;\n" +
            "из положения стоя – 2 месяца.\n" +
            "Исключить: наклоны, глубокие приседания, прыжки, ускорения, поднятие тяжестей, очень интенсивные упражнения.\n" +
            "Включить: гимнастические упражнения на растяжку, для поясничного отдела позвоночника и брюшного пресса. Минимальное количество повторов – 10 раз.\n" +
            "Если произошел перерыв в физических занятиях, необходимо снова начать выполнение уровня физической нагрузки, начиная с нагрузки первой недели.\n" +
            "Перед выполнением вышеуказанной программы рекомендуется выполнить ЭКГ и повторять ее ежемесячно.\n" +
            "Рекомендуемая система физической активности:\n" +
            "лечебная ходьба – 3 раза в неделю;\n" +
            "плавание – 2 раза в неделю;\n" +
            "физические упражнения в сочетании с лечебной ходьбой или плаванием – 5 раз в неделю;\n" +
            "отдых – один день в неделю.\n" +
            "Pекомендуемая физическая нагрузка для пациентов с ИМТ от 25 до 29,9.\n" +
            "Первая неделя - 2000 шагов в день. Каждую неделю увеличивать количество шагов на 500, к восьмой неделе должно быть до 6000 шагов в день (четыре километра). Дистанцию в четыре километра необходимо проходить ежедневно в течение двух или трех месяцев до тех пор, пока не получится ее легко преодолевать за 60 минут. Затем снижать время прохождения 4-х километров на 5 минут. Достигнув хорошей переносимости этой нагрузки необходимо проходить четыре километра за 45 минут три раза в день или 8-12 километров один раз в день.\n" +
            "При хорошем самочувствии необходимо начать посещение бассейна. Первое занятие должно длиться 10 минут, второе – 15 минут, третье – 20 минут, далее прибавлять по 5 минут на каждое занятие. Максимальная длительность плавания не должна превышать 45 минут на занятие.\n" +
            "Плавание и ходьбу необходимо чередовать через день. При этом, можно делать один или два дня отдыха в неделю.\n" +
            "Через 6 месяцев занятий лечебной ходьбой и плаванием необходимо расширить активность, добавив комплекс гимнастических упражнений под контролем врача лечебной физкультуры.\n" +
            "Рекомендуемая физическая нагрузка для пациентов с ИМТ от 30 до 34,9 (что соответствует I степени ожирения).\n" +
            "Первый уровень физической нагрузки - лечебная ходьба от 1000 шагов в день, постепенно увеличивая количество шагов до 6000 (четыре километра) к 10-ой неделе.\n" +
            "Далее ежемесячно необходимо повышать интенсивность физической нагрузки: проходить четыре километра за 60 минут в первый месяц и за 45 минут к четвертому месяцу.\n" +
            "Второй уровень физической нагрузки – плавание. Первое занятие - 5 минут, затем увеличивать время каждого занятия на 3-5 минут до 30 минут к восьмому занятию.\n" +
            "После шести месяцев занятий ходьбой и плаванием можно переходить к третьему уровню– гимнастическим упражнениям.\n" +
            "Рекомендуемая физическая нагрузка для пациентов с ИМТ от 35 до 39,9 (что соответствует II степени ожирения).\n" +
            "Лечебную ходьбу начинать с 300 шагов в день, постепенно увеличивая до 6000 (четыре километра) шагов к 15 неделе. Четыре километра необходимо ходить в течение 6 месяцев, постепенно повышая интенсивность (4 километра за 60 минут, 4 километра за 55 минут, 4 километра за 50 минут). Четыре километра за 50 минут необходимо ходить не менее 12 месяцев.\n" +
            "Второй уровень физических занятий – плавание. Первое занятие - 5 минут, постепенно увеличивая время до 20 минут к десятому занятию\n" +
            "Плавание и ходьбу необходимо чередовать через день. При этом можно делать один или два дня отдыха в неделю. После шести месяцев занятий ходьбой и плаванием можно переходить к третьему уровню – физическим упражнениям.\n" +
            "Рекомендуемая физическая нагрузка для пациентов с ИМТ более 40 (что соответствует морбидному ожирению).\n" +
            "Занятия начинаются с лечебной ходьбы. Первая неделя 100 шагов в минуту 3 раза в день после еды, к шестой неделе постепенно увеличивать количество шагов до 500 за пять минут 3 раза в день. С седьмой неделе – 600 шагов в день без учета времени и далее постепенно увеличивать количество шагов примерно по 100 каждый день до 6000 шагов к девятому месяцу (36 недель). Постепенно снижать время прохождения 4-х километров с 60 минут до 55 минут.\n" +
            "После выполнения предложенного уровня ходьбы, можно добавить плавание. Первое занятие - 5 минут. Каждое занятие увеличивать продолжительность на 1 минуту. К 14 занятию – время плавания 20 минут. Плавать 20 минут за одно занятие в течение 6 месяцев.\n" +
            "После одного года занятий ходьбой и плаванием можно переходить к третьему уровню – гимнастическим упражнениям.\n" +
            "Регулярную физическую активность можно также представить в виде пирамиды:\n" +
            "основание пирамиды - ежедневные пешие прогулки;\n" +
            "следующий уровень - занятия, которые помогают улучшить физическую тренированность (3-5 раз в неделю рекомендуется один из видов аэробных упражнений);\n" +
            "вершина пирамиды - неактивный отдых (рекомендуется проводить за просмотром телепередач не более 30 минут в день).\n" +
            "Преодоления стрессовых ситуаций: ежедневно рекомендуется здоровое питание, физическая активность, достаточный сон, наличие работы или хобби, отдых с семьей, позитивное общение с другими, смех, участие в социальной жизни."
}